tutorials/incompressible/simpleSolver/ras/GeorgiaTechRotorSource/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 10;

method		scotch;

simpleCoeffs
{
    n               (28 1 1);
    delta           0.001;
}

hierarchicalCoeffs
{
    n               (4 2 1);
    delta           0.0001;
    order           xyz;
}

manualCoeffs
{
    dataFile        "cellDecomposition";
}
   
    distributed no;
    roots ();

// ************************************************************************* //
