tutorials/incompressible/simpleSolver/ras/GeorgiaTechRotorSource/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default            steadyState;
}

gradSchemes
{
    default             leastSquares;
    grad(p)             leastSquares;
    grad(U)             cellMDLimited leastSquares 1;
}

divSchemes
{
    default                         none;
    div(phi,U)                      Gauss linearUpwindBJ grad(U) 0.5;
    div((nuEff*dev(T(grad(U)))))    Gauss linear;
    div(phi,epsilon)                Gauss upwind;
    div(phi,k)                      Gauss upwind;
}

laplacianSchemes
{
    default             none;
    laplacian(nuEff,U)  Gauss linear corrected;
    laplacian(rAUf,p)   Gauss linear corrected;
    laplacian(DepsilonEff,epsilon) Gauss linear limited 0.5;
    laplacian(DkEff,k)  Gauss linear limited 0.5;
}

interpolationSchemes
{
    default             linear;
}

snGradSchemes
{
    default             linear;
}


// ************************************************************************* //
