tutorials/incompressible/simpleSolver/ras/GeorgiaTechRotorSource/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        tolerance        1e-8;
        relTol           0.01;
        smoother         SSGS;
        nPreSweeps       0;
        nPostSweeps      2;
        cacheAgglomeration on;
        agglomerator     faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels      1;
    }

    U
    {
        solver           PBiCGStab;
        preconditioner   USGS;
        tolerance        1e-8;
        relTol           0.1;
    }

    k
    {
        solver           PBiCGStab;
        preconditioner   USGS;
        tolerance        1e-8;
        relTol           0.1;
    }

    epsilon
    {
        solver           PBiCGStab;
        preconditioner   USGS;
        tolerance        1e-8;
        relTol           0.1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;

    pRefCell            0;
    pRefValue           0;

    residualControl
    {
        p               1e-08;
        U               1e-09;
        "(k|epsilon)"   1e-09;
    }
}

relaxationFactors
{
    p               0.3;
    U               0.5;
    k               0.5;
    epsilon         0.5;
}

cache
{
    grad(U);
}

// ************************************************************************* //
